/**
 * @date 2022/9/13 - 19:27
 * 关于java JDK中内置的一个类，java.lang.Strig
 *   1.String表示字符串属于引用数据类型，不属于基本数据类型
 *   2.在java中随便使用双引号括起来的都属于String类型：“abc”  "你好"
 *   3.java中规定双引号括起来的字符串都是不可变的。也就是说“abc”自出生到死亡不可变
 *   4.在讲JDK当中双引号括起来的字符串都是直接存储在 方法区 的 字符串常量池 当中
 *     为什么Sun公司把字符串存储在一个 字符串常量池 当中?
 *        因为字符串在实际的开发当中使用太频繁，为了执行效率，所以把字符串放在了方法区的字符串常量池
 */
public class String字符串的储存原理 {
    public static void main(String[] args) {
        //这两行代码表示低层创建了三个字符串对象，都在字符串常量池中。
        String str = "abcd";//方法区的字符串常量池
        String str2 = "abcd"+"ef";

        //分析:这是使用了new的方式创建的字符串对象。分析这个代码中的“ef”是从哪里来的?
        //凡是双引号括起来的都在字符串常量池中有一份
        //new一定在堆内存当中开辟空间
        String str3 = new String("ef");
    }
}
